OdDAI.AttributeDataBlock.unset
\details
Clears all data.

OdDAI.AttributeDataBlock.toString
\details
Converts the attribute data block data into a string representation.
\returns A string that contains text representation of the attribute data block information.

OdDAI.AttributeDataBlock.op_Assign(OdDAI.AttributeDataBlock!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Copies one attribute data block object to another (assignment operator).
\param rightValue [in] Another attribute data block object to copy from (the right-hand operand of the assignment operation).
\returns The reference to the attribute data block modified with the assignment operator.

OdDAI.AttributeDataBlock.op_Equality(OdDAI.AttributeDataBlock!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Compares two attribute data block.
\param rightValue [in] Another attribute data block to compare (the right-hand operand of the comparison operation).
\returns true if attribute data block objects are equal; otherwise, the operator returns false.

OdDAI.AttributeDataBlock.#ctor(OdDAI.AttributeDataBlock!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates a new empty instance of attribute data block as a copy of another attribute data block (copy constructor).
\param rightValue [in] Another attribute data block object to copy from.

OdDAI.AttributeDataBlock.#ctor
\details
Creates a new empty instance of attribute data block.

OdDAI.AttributeDataBlock
\details
A class that implements working with attribute data blocks. An attribute data block is used for simple move, copy, edit operations for Select data type.